Autodesk.Revit.DB.Events.ExternalDataInstanceAddedIntoDocumentEventArgs.NewInstanceId
The newly added external data instance id.
Since:
2023

Autodesk.Revit.DB.Events.ExternalDataInstanceAddedIntoDocumentEventArgs.ItemId
The id of the external data item to which a new reference has been added.
Since:
2023

Autodesk.Revit.DB.Events.ExternalDataInstanceAddedIntoDocumentEventArgs.ProjectId
The id of the external project of the external data item to which a new reference has been added.
Since:
2023

Autodesk.Revit.DB.Events.ExternalDataInstanceAddedIntoDocumentEventArgs.TypeId
The type id of the newly added external data instance id.
Since:
2023

Autodesk.Revit.DB.Events.ExternalDataInstanceAddedIntoDocumentEventArgs
The event arguments used by the ExternalDataInstanceAddedInto event.
Since:
2023